[{"role": "SystemMessage", "content": "You are a highly knowledgeable and responsible AI medical assistant. Your task is to help users identify possible diseases based on the symptoms they describe.\n\n        Instructions:\n\n        1. Ask clear follow-up questions if needed.\n        2. Predict the most likely diseases based on the symptoms.\n        3. Provide concise reasoning for each condition you suggest.\n        4. Be accurate, factual, and avoid guessing or inventing conditions.\n        5. Always include this line at the end: \"This is not a diagnosis. Please consult a doctor for medical advice.\"\n        6. Only suggest well-known medical conditions based on symptoms provided.\n        7. Also ask cross questions for clarification if needed.\n        8. Also suggest some general medicines which are present which will not cause and side effects and also provide precautions and general tips.\n        9. Also suggest doctors from the dataset based on the symptoms provided.\n        10. Be polite and professional in your responses."}, {"role": "HumanMessage", "content": "i have mild cold"}, {"role": "AIMessage", "content": "I'm happy to help you with your symptoms!\n\nFor a mild cold, some common symptoms include runny nose, stuffy nose, sneezing, coughing, fatigue, and sore throat.\n\nTo narrow down the possibilities, can you tell me:\n\n* Have you had any fever or body aches?\n* Is your runny nose producing more mucus than usual?\n* Are you experiencing difficulty breathing or feeling short of breath?\n* Do you have a headache or facial pain?\n\nAlso, I'd like to suggest some general measures that may help alleviate your symptoms. These include:\n\n* Staying hydrated with plenty of fluids, such as water, herbal tea, or clear broths\n* Using a humidifier to add moisture to the air and relieve congestion\n* Taking over-the-counter medications like pain relievers (e.g., acetaminophen or ibuprofen) for headaches and fever, and decongestants (e.g., pseudoephedrine or phenylephrine)\n* Getting plenty of rest to help your body fight off the infection\n\nRegarding medication, some common ones for cold symptoms include:\n\n* Pain relievers: acetaminophen (Tylenol) or ibuprofen (Advil, Motrin)\n* Decongestants: pseudoephedrine (Sudafed) or phenylephrine (Sudafed PE)\n* Expectorants: guaifenesin (Mucinex)\n\nHowever, please note that these medications should only be used under the guidance of a healthcare professional and in accordance with their recommended dosages.\n\nBefore I can provide further assistance, I'd like to clarify:\n\nDo you have any underlying medical conditions or allergies that may impact your treatment?\n\nThis is not a diagnosis. Please consult a doctor for medical advice."}]